// 业务字典数据
export default {
	coupon_status: { //券状态字典
		'F01': '未发放',
		'F02': '已领用',
		'J01': '可使用',
		'J02': '未售出已过期',
		'J03': '已使用',
		'J04': '已作废',
		'J05': '已退货',
		'J06': '售出已过期',
		'Z01': '转赠中',
		'S01': '已锁定',
		'J07': '过期退款',
		'J08': '过期后核销',
		'J09': '过期后转入'
	},
	card_status: {//卡状态字典
		'Z001': '正常',
		'Z002': '冻结',
		'Z003': '注销',
		'Z004': '挂失',
		'Z005': '作废',
		'Z006': '转赠中',
		'Z007': '未激活',
	},
	card_type: {//卡类型字典
		'Z001': '实体VIP卡',
		'Z002': '实体礼品卡',
		'Z003': '电子礼品卡',
		'Z004': 'sap优惠券',
		'Z005': '电子储值账户'
	},
	card_order_type:{//卡订单交易类型
		'Z001': '充值',
		'Z002': '退款(退卡)',
	},
	keban_coupon_type: {//可伴券类型
		'1': '定额券',
		'2': '不定额券'
	}
}
